# GetResourceString

## Description
<b>Deprecated since Vectorworks 2015</b>: Use [[VS:GetVWRString]] instead.

<br>
Returns the specified resource string from a resource file.

```pascal
PROCEDURE GetResourceString(
				VAR theString : STRING;
				id            : INTEGER;
				index         : INTEGER);
```

```python
def vs.GetResourceString(id, index):
    return theString
```

## Parameters
|Name|Type|Description|
|---|---|---|
|theString|STRING|The string contained within the resource.|
|id|INTEGER|The ID of the resource.|
|index|INTEGER|The index of the string resource.|

## See Also
VS Functions:
GetVWRString ,
SetVSResourceFile

## Version
Availability: from VectorWorks 9.0
<b>Deprecated since Vectorworks 2015</b>: Use [[VS:GetVWRString]] instead.

## Category
* Strings